---
kind: method
id: M:Autodesk.Revit.DB.BackgroundSettings.Dispose
source: html/007840b9-75af-722d-6ce3-bf61cbd8d620.htm
---
# Autodesk.Revit.DB.BackgroundSettings.Dispose Method

Releases all resources used by the BackgroundSettings

## Syntax (C#)
```csharp
public void Dispose()
```